In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(seed=0)
df = pd.DataFrame(np.random.rand(4, 4),
                  index = ["Alpha", "Beta", "Charlie", "Delta"],
                  columns = ["Jan", "Feb", "Mar", "Apr"]
                  )
df

              Jan       Feb       Mar       Apr
Alpha    0.548814  0.715189  0.602763  0.544883
Beta     0.423655  0.645894  0.437587  0.891773
Charlie  0.963663  0.383442  0.791725  0.528895
Delta    0.568045  0.925597  0.071036  0.087129

In [11]:
df.loc[["Alpha","Delta"]]

            Jan       Feb       Mar       Apr
Alpha  0.548814  0.715189  0.602763  0.544883
Delta  0.568045  0.925597  0.071036  0.087129

In [15]:
df.loc["Alpha":"Charlie"]

              Jan       Feb       Mar       Apr
Alpha    0.548814  0.715189  0.602763  0.544883
Beta     0.423655  0.645894  0.437587  0.891773
Charlie  0.963663  0.383442  0.791725  0.528895

In [16]:
df.loc["Alpha":"Delta","Mar"]

Alpha      0.602763
Beta       0.437587
Charlie    0.791725
Delta      0.071036
Name: Mar, dtype: float64

In [17]:
df.loc["Alpha":"Charlie", "Feb"]

Alpha      0.715189
Beta       0.645894
Charlie    0.383442
Name: Feb, dtype: float64

In [18]:
df.loc["Alpha":"Beta", "Jan":"Mar"]

            Jan       Feb       Mar
Alpha  0.548814  0.715189  0.602763
Beta   0.423655  0.645894  0.437587

In [19]:
df.loc[:, "Feb"]

Alpha      0.715189
Beta       0.645894
Charlie    0.383442
Delta      0.925597
Name: Feb, dtype: float64

In [20]:
df

              Jan       Feb       Mar       Apr
Alpha    0.548814  0.715189  0.602763  0.544883
Beta     0.423655  0.645894  0.437587  0.891773
Charlie  0.963663  0.383442  0.791725  0.528895
Delta    0.568045  0.925597  0.071036  0.087129

In [22]:
df.loc[:, ["Mar", "Apr"]]

              Mar       Apr
Alpha    0.602763  0.544883
Beta     0.437587  0.891773
Charlie  0.791725  0.528895
Delta    0.071036  0.087129

In [23]:
df.loc[[;, ["Jan", "Feb"]]]

SyntaxError: invalid syntax (3837673724.py, line 1)

## iloc

 - This is used without the quotes as index is reccognized as an integer.

In [2]:
import numpy as np
import pandas as pd

In [3]:
np.random.seed(seed =0)
df = pd.DataFrame(np.random.randn(3, 3),
index = ["A", "B", "C"],
columns = ["Poor", "Average", "Good"])
df

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278
C  0.950088 -0.151357 -0.103219

In [11]:
df.iloc[1]

Poor       2.240893
Average    1.867558
Good      -0.977278
Name: B, dtype: float64

In [12]:
df

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278
C  0.950088 -0.151357 -0.103219

In [15]:
df.iloc[2,1]

np.float64(-0.1513572082976979)

In [16]:
df

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278
C  0.950088 -0.151357 -0.103219

In [17]:
df.iloc[[0, 1, 2]]

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278
C  0.950088 -0.151357 -0.103219

In [18]:
df.iloc[[2], [0, 1]]

       Poor   Average
C  0.950088 -0.151357

In [19]:
df

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278
C  0.950088 -0.151357 -0.103219

In [25]:
df.iloc[:1,1:]

    Average      Good
A  0.400157  0.978738

In [26]:
df

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278
C  0.950088 -0.151357 -0.103219

In [28]:
df.iloc[:2]

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278

In [30]:
df

       Poor   Average      Good
A  1.764052  0.400157  0.978738
B  2.240893  1.867558 -0.977278
C  0.950088 -0.151357 -0.103219

In [33]:
df.iloc[:, 1:2]

    Average
A  0.400157
B  1.867558
C -0.151357

## .query()

In [37]:
import numpy as np
import pandas as pd

In [39]:
np.random.seed(seed =1)
df = pd.DataFrame(np.random.randint(35, 8745,(5, 6)),
index = ["A", "B", "C", "D", "E"],
columns = ["Col1", "Col2", "Col3", "Col4", "Col5", "Col6"])
df

   Col1  Col2  Col3  Col4  Col5  Col6
A   270  5227   940  7848  2930  5091
B   179  4260  7786  3497  5431  5409
C  2997  2551  8479  3597  4799  8128
D  6577   597  8186  3084   788  1923
E  1145  6320  6156  1066  4450  2912

In [49]:
df[min]

A     270
B     179
C    2997
D    6577
E    1145
Name: Col1, dtype: int32

In [54]:
df.query("Col3 > 2000 or Col2 == 0")

   Col1  Col2  Col3  Col4  Col5  Col6
B   179  4260  7786  3497  5431  5409
C  2997  2551  8479  3597  4799  8128
D  6577   597  8186  3084   788  1923
E  1145  6320  6156  1066  4450  2912

In [50]:
df

   Col1  Col2  Col3  Col4  Col5  Col6
A   270  5227   940  7848  2930  5091
B   179  4260  7786  3497  5431  5409
C  2997  2551  8479  3597  4799  8128
D  6577   597  8186  3084   788  1923
E  1145  6320  6156  1066  4450  2912

In [56]:
df.query("Col6 < 179" and "Col5 < 1000")

   Col1  Col2  Col3  Col4  Col5  Col6
D  6577   597  8186  3084   788  1923

In [58]:
np.random.seed(seed=1)
df = pd.DataFrame(np.random.randint(0, 68, (4, 5)), 
index = ["A", "B", "C", "D",],
columns = ["Col1", "Col2", "Col3", "Col4", "Col5"]
)
df

   Col1  Col2  Col3  Col4  Col5
A    37    12     9     5    64
B    16     1     6    25    50
C    20    18    11    28    29
D    14    50    13     9     7

In [63]:
np.min(df)

np.int32(1)

In [65]:
df.query("Col1 < 12 or Col2 < 11 and Col4 > 8")

   Col1  Col2  Col3  Col4  Col5
B    16     1     6    25    50